#include "Header.h"

/*
// 1, 2, 4, 5

1. float 자료형 100개를 저장할 수 있는 배열을 선언하고
   요소를 1.0f , 0.99f, 0.98f ~ 0.01f 까지 순서대로 저장한 뒤
   출력해주세요.

2. 1 ~ 100까지의 짝수만을 저장하는 배열을 만들고 출력해주세요.

3. 0 ~ 100 중 홀수 index 에는 짝수가 짝수 index 에는 홀수가 저장되는
   배열을 선언해주세요.
   * arr[0] 은 0 고정입니다.
   ex ) arr[0] = 0
        arr[1] = 2
        arr[2] = 1
        arr[3] = 4
        arr[4] = 3
        .
        .
        .
        arr[100] = 99
        로 출력되도록 만들어주세요.

4. int Array[10] = { 1, 5, 7, 3, 9, 4, 10, 15, -1, 20 }
   에서 가장 큰 수를 찾아 출력하는 프로그램을 만들어주세요.

5. int Array[10] = { 2, 4, 6, 6, 8, 2, 2, 4, 2, 10 }
   에서 가장 많이 중복되는 수를 찾는 프로그램을 만들어주세요.

6. int Array[10] = { 1, 4, 7, 2, 3, 5, 9, 8, 6, 10 }
   의 요소가 오름차순으로 정렬되는 Bubble sort(버블정렬) 프로그램을 만들어주세요.

7. int Array1[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
   int Array2[10] = { 10, 9, 8, 7, 6, 5, 4, 3, 2, 1};
   Array1 과 Array2 가 가지고 요소가 서로 뒤바뀌는 프로그램을 만들어주세요.

*/


void Start()
{


}

void KeyDown(WPARAM wParam)
{
    switch (wParam)
    {

    }
}

void Paint(HDC & hdc)
{

}

void Update()
{

}